# Movie Recommendation

In [40]:
# Import Libraries

import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [41]:
# Get Datasets for rating, user_id, rating, timestamp

df = pd.read_csv('./file.tsv', sep='\t', names=['user_id', 'item_id', 'rating', 'timestamp'])

In [42]:
# first five elements of df

df.head()

   user_id  item_id  rating  timestamp
0        0       50       5  881250949
1        0      172       5  881250949
2        0      133       1  881250949
3      196      242       3  881250949
4      186      302       3  891717742

In [43]:
# get the movies and their respective IDs

movie_titles = pd.read_csv('./Movie_Id_Titles.csv')

In [44]:
# first five elements of movie_titles

movie_titles.head()

   item_id              title
0        1   Toy Story (1995)
1        2   GoldenEye (1995)
2        3  Four Rooms (1995)
3        4  Get Shorty (1995)
4        5     Copycat (1995)

In [45]:
# merge df and movie_titles by item_id

data = pd.merge(df, movie_titles, on='item_id')

In [46]:
# first five elements of data

data.head()

   user_id  item_id  rating  timestamp             title
0        0       50       5  881250949  Star Wars (1977)
1      290       50       5  880473582  Star Wars (1977)
2       79       50       4  891271545  Star Wars (1977)
3        2       50       5  888552084  Star Wars (1977)
4        8       50       5  879362124  Star Wars (1977)

In [47]:
data.count()

user_id      100003
item_id      100003
rating       100003
timestamp    100003
title        100003
dtype: int64

In [48]:
data.groupby('title')['rating']

In [49]:
# Calculate mean rating of all movies
data.groupby('title')['rating'].mean().sort_values(ascending=False).head()

title
They Made Me a Criminal (1939)                5.0
Marlene Dietrich: Shadow and Light (1996)     5.0
Saint of Fort Washington, The (1993)          5.0
Someone Else's America (1995)                 5.0
Star Kid (1997)                               5.0
Name: rating, dtype: float64

In [50]:
# Calculate count rating of all movies
data.groupby('title')['rating'].count().sort_values(ascending=False).head()

title
Star Wars (1977)             584
Contact (1997)               509
Fargo (1996)                 508
Return of the Jedi (1983)    507
Liar Liar (1997)             485
Name: rating, dtype: int64

In [51]:
# creating dataframe with 'rating' count values

ratings = pd.DataFrame(data.groupby('title')['rating'].mean()) 
ratings

                                         rating
title
'Til There Was You (1997)              2.333333
1-900 (1994)                           2.600000
101 Dalmatians (1996)                  2.908257
12 Angry Men (1957)                    4.344000
187 (1997)                             3.024390
...                                         ...
Young Guns II (1990)                   2.772727
Young Poisoner's Handbook, The (1995)  3.341463
Zeus and Roxanne (1997)                2.166667
unknown                                3.444444
Á köldum klaka (Cold Fever) (1994)     3.000000

[1664 rows x 1 columns]

In [52]:
ratings['num of ratings'] = pd.DataFrame(data.groupby('title')['rating'].count())

In [53]:
ratings.head()

                             rating  num of ratings
title
'Til There Was You (1997)  2.333333               9
1-900 (1994)               2.600000               5
101 Dalmatians (1996)      2.908257             109
12 Angry Men (1957)        4.344000             125
187 (1997)                 3.024390              41